<a href="https://colab.research.google.com/github/KanagalaAjay/Python_Scripts/blob/main/Lab_4_SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://

'Connected: @None'

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS employees(employee_num integer,

                      last_name text,

                      first_name text,

                      salary integer,

                      dept_id integer,

                      age integer);

 * sqlite://
Done.

[]

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS managers(mgr_num integer,

                      last_name text,

                      first_name text,

                      salary integer,

                      dept_id integer,

                      age integer);

 * sqlite://
Done.

[]

In [ ]:
%%sql

INSERT INTO employees VALUES(1001, 'Smith','John', 62000, 500,32);

INSERT INTO employees VALUES(1002, 'Anderson','Jane', 87500, 500,40);

INSERT INTO employees VALUES(1003, 'Everest','Brad', 71000, 501,26);

INSERT INTO employees VALUES(1004, 'Horvath','Brain', 62000, 501,44);

 

INSERT INTO managers VALUES(101, 'White','Jonathan', 152000, 500,38);

INSERT INTO managers VALUES(102, 'Smith','Paul', 120000, 501,40);

INSERT INTO managers VALUES(102, 'Cowgill','Richard', 150000, 502,50);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

After successfully create the two tables, please write sql queries to answer the following questions:

1. Display employees older than 30 years old (expected output: last_name, first_name, age)
2. Display employees whose first names end in “n”( expected output: last_name, first_name)
3. Find managers make more than $130k   and less than $160k. (expected output: last_name, first_name, salary)
4. Find employees older than his/her manager (expected output: emp_LastName, emp_FirstName, mgr_LastName, mgr_FirstName, ageDiff) Hint: ageDiff = employees.age – managers.age
5. For each department, find the employee who makes the most. (expected output: dept_id, FirstName, LastName, salary)

In [ ]:
# 1. Display employees older than 30 years old (expected output: last_name, first_name, age)
%%sql  
select last_name, first_name, age  
from employees 
where age > 30;

 * sqlite://
Done.

[('Smith', 'John', 32), ('Anderson', 'Jane', 40), ('Horvath', 'Brain', 44)]

In [ ]:
#2. Display employees whose first names end in “n”( expected output: last_name, first_name)

%%sql  

select last_name,first_name  
from employees 
where first_name like "%n";

 * sqlite://
Done.

[('Smith', 'John'), ('Horvath', 'Brain')]

In [ ]:
#3. Find managers make more than  130k and less than 160k. (expected output: last_name, first_name, salary)

%%sql  
select last_name,first_name, salary
from managers 
where salary > 130000
and salary < 160000;

 * sqlite://
Done.

[('White', 'Jonathan', 152000), ('Cowgill', 'Richard', 150000)]

In [ ]:
# 4. Find employees older than his/her manager (expected output: emp_LastName, emp_FirstName, mgr_LastName, mgr_FirstName, ageDiff) 
# Hint: ageDiff = employees.age – managers.age

%%sql


select e.last_name as emp_lastName, e.first_name as emp_firstName, 
       m.last_name as mgr_lastName, m.first_name as mgr_firstName,
        e.age-m.age as ageDiff
from employees e, managers m 
where e.dept_id = m.dept_id
and e.age> m.age
order by ageDiff;

 * sqlite://
Done.

[('Anderson', 'Jane', 'White', 'Jonathan', 2),
 ('Horvath', 'Brain', 'Smith', 'Paul', 4)]

In [ ]:
# For each department, find the employee who makes the most. (expected output: dept_id, FirstName, LastName, salary)

%%sql  
select dept_id, first_name, last_name ,max(salary) as salary 
from employees 
group by dept_id 
order by dept_id;

 * sqlite://
Done.

[(500, 'Jane', 'Anderson', 87500), (501, 'Brad', 'Everest', 71000)]